<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Untitled Document</title>
</head>

<body>
<p><strong>LISTADO DE ACTIVIDADES ACADEMICAS EN LINEA:</strong></p>
<ul>
  <li>
    <div align="left"><strong>Wix:</strong> Es una plataforma de desarrollo web basada en la nube que fue desarrollada y popularizada por la compa&ntilde;&iacute;a israel&iacute; tambi&eacute;n llamada Wix. Permite a los usuarios crear sitios web&nbsp;HTML5&nbsp;y sitios&nbsp;m&oacute;viles&nbsp;a trav&eacute;s del uso de herramientas de&nbsp;arrastrar y soltar&nbsp;en l&iacute;nea.&nbsp;Los usuarios pueden agregar funcionalidades como&nbsp;plug-ins,&nbsp;e-commerce, formularios de contacto, marketing por correo electr&oacute;nico, y foros comunitarios con sus sitios web utilizando una variedad de aplicaciones desarrolladas por Wix y de terceros.<a href="https://es.wikipedia.org/wiki/Wix.com#cite_note-TechCrunch-2"></a>    </div>
    <p align="justify">Wix es construido en un modelo de negocio&nbsp;freemium, ganando sus ingresos a trav&eacute;s de actualizaciones premium. Los usuarios deben comprar paquetes premium para conectar sus sitios a sus propios dominios, eliminar los anuncios Wix, a&ntilde;adir capacidades de comercio electr&oacute;nico o comprar almacenamientos de datos y ancho de banda adicionales.</p>
  </li>
</ul>
<p align="left">Wix.com. (2017, 9 de abril).&nbsp;<em>Wikipedia, La enciclopedia libre</em>. Fecha de consulta: 21:13, abril 15, 2017 desde&nbsp;<a href="https://es.wikipedia.org/w/index.php?title=Wix.com&amp;oldid=98236567">https://es.wikipedia.org/w/index.php?title=Wix.com&amp;oldid=98236567</a>.</p>

  
    
      <div align="left">
        <ul>
          <li><strong>Dropbox:</strong>&nbsp;Es un&nbsp;servicio de alojamiento de archivos&nbsp;multiplataforma&nbsp;en la nube, operado por la compa&ntilde;&iacute;a Dropbox. El servicio permite a los usuarios almacenar y sincronizar archivos en l&iacute;nea y entre ordenadores y compartir archivos y carpetas con otros usuarios y con tabletas y m&oacute;viles.<a href="https://es.wikipedia.org/wiki/Dropbox#cite_note-1"></a>&nbsp;Existen versiones gratuitas y de pago, cada una de las cuales tiene opciones variadas. La versi&oacute;n m&oacute;vil est&aacute; disponible para&nbsp;Android,&nbsp;Windows Phone,&nbsp;Blackberry&nbsp;e&nbsp;iOS&nbsp;(Apple). Actualmente cuenta con m&aacute;s de 500 millones de usuarios registrados.</li>
        </ul>
      </div>
      <p align="left">Dropbox. (2017, 27 de marzo).&nbsp;<em>Wikipedia, La enciclopedia libre</em>. Fecha de consulta: 21:16, abril 15, 2017 desde&nbsp;<a href="https://es.wikipedia.org/w/index.php?title=Dropbox&amp;oldid=97883341">https://es.wikipedia.org/w/index.php?title=Dropbox&amp;oldid=97883341</a>.</p>

  
    
      <div align="left">
        <ul>
          <li><strong>OneDrive</strong>&nbsp;(antes&nbsp;SkyDrive,&nbsp;Microsoft SkyDrive,&nbsp;Windows Live SkyDrive&nbsp;y&nbsp;Windows Live Folders) es un&nbsp;servicio de alojamiento de archivos. Fue estrenado el 18 de febrero de 2014. Actualmente, este servicio ofrece 5 GB de almacenamiento gratuito,<a href="https://es.wikipedia.org/wiki/OneDrive#cite_note-1"></a>&nbsp;m&aacute;s 15 GB para el &aacute;lbum de c&aacute;mara&nbsp;, los cuales&nbsp;<strong>se les ha retirado a muchos usuarios</strong>, que hab&iacute;an adquirido ese derecho por la compra de alg&uacute;n smartphone Lumia. Se pueden subir hasta 5 archivos a la vez de manera est&aacute;ndar con cualquier navegador, y tambi&eacute;n se puede instalar una herramienta&nbsp;ActiveX&nbsp;que permite arrastrar un n&uacute;mero ilimitado de archivos directamente desde el&nbsp;Explorador de Windows. Es accesible por su p&aacute;gina web desde ordenadores y dispone de aplicaciones para&nbsp;Windows 10&nbsp;(app UWP),&nbsp;Windows 8,&nbsp;Windows Phone,&nbsp;iOS&nbsp;y&nbsp;Android&nbsp;que permiten editar documentos y hojas de c&aacute;lculo.</li>
        </ul>
      </div>
      <p align="left">OneDrive. (2017, 2 de abril).&nbsp;<em>Wikipedia, La enciclopedia libre</em>. Fecha de consulta: 21:20, abril 15, 2017 desde&nbsp;<a href="https://es.wikipedia.org/w/index.php?title=OneDrive&amp;oldid=98049839">https://es.wikipedia.org/w/index.php?title=OneDrive&amp;oldid=98049839</a>.</p>
</body>
</html>
