<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Untitled Document</title>
</head>

<body>
 <p align="center"><strong>QUE ES Y PARA QU&Eacute; SIRVE LA HERRAMIENTA GIT</strong></p>
 <center><table width="1136">
   <tr>
     <td width="567" align="left"><p align="justify"><strong>GIT:</strong>&nbsp;Es  un software de control de versiones dise&ntilde;ado por Linus Torvalds, pensando en la  eficiencia y la confiabilidad del mantenimiento de versiones de aplicaciones  cuando &eacute;stas tienen un gran n&uacute;mero de archivos de c&oacute;digo fuente. Al principio,  Git se pens&oacute; como un motor de bajo nivel sobre el cual otros pudieran escribir  la interfaz de usuario o front end como Cogito o StGIT. 3 Sin embargo, Git se  ha convertido desde entonces en un sistema de control de versiones con  funcionalidad plena. 4 Hay algunos proyectos de mucha relevancia que ya usan  Git, en particular, el grupo de programaci&oacute;n del n&uacute;cleo Linux. </p>
     <p align="justify"><strong>Caracteristicas de GIT: </strong></p>
     <p align="justify">El dise&ntilde;o de Git resulta de la experiencia del dise&ntilde;ador de&nbsp;Linux,&nbsp;Linus Torvalds, manteniendo una enorme cantidad de c&oacute;digo distribuida y gestionada por mucha gente, que incide en numerosos detalles de rendimiento, y de la necesidad de rapidez en una primera implementaci&oacute;n.</p>
     <p align="left">Entre las caracter&iacute;sticas m&aacute;s relevantes se encuentran:</p>
     
       <div align="left">
         <ul>
           <li>Fuerte apoyo al desarrollo no lineal, por ende rapidez en la gesti&oacute;n de ramas y mezclado de diferentes versiones. Git incluye herramientas espec&iacute;ficas para navegar y visualizar un historial de desarrollo no lineal. Una presunci&oacute;n fundamental en Git es que un cambio ser&aacute; fusionado mucho m&aacute;s frecuentemente de lo que se escribe originalmente, conforme se pasa entre varios programadores que lo revisan.</li>
           <li>Gesti&oacute;n distribuida. Al igual que&nbsp;Darcs,&nbsp;BitKeeper,&nbsp;Mercurial,&nbsp;SVK,&nbsp;Bazaar&nbsp;y&nbsp;Monotone, Git le da a cada programador una copia local del historial del desarrollo entero, y los cambios se propagan entre los repositorios locales. Los cambios se importan como ramas adicionales y pueden ser fusionados en la misma manera que se hace con la rama local.</li>
           <li>Los almacenes de informaci&oacute;n pueden publicarse por&nbsp;HTTP,&nbsp;FTP,&nbsp;rsync&nbsp;o mediante un protocolo nativo, ya sea a trav&eacute;s de una conexi&oacute;n TCP/IP simple o a trav&eacute;s de cifrado&nbsp;SSH. Git tambi&eacute;n puede emular servidores&nbsp;CVS, lo que habilita el uso de clientes CVS pre-existentes y m&oacute;dulos IDE para CVS pre-existentes en el acceso de repositorios Git.</li>
           <li>Los repositorios Subversion y svk se pueden usar directamente con git-svn.</li>
           <li>Gesti&oacute;n eficiente de proyectos grandes, dada la rapidez de gesti&oacute;n de diferencias entre archivos, entre otras mejoras de optimizaci&oacute;n de velocidad de ejecuci&oacute;n.</li>
           <li>Todas las versiones previas a un cambio determinado, implican la notificaci&oacute;n de un cambio posterior en cualquiera de ellas a ese cambio (denominado autenticaci&oacute;n criptogr&aacute;fica de historial). Esto exist&iacute;a en&nbsp;Monotone.</li>
           <li>Resulta algo m&aacute;s caro trabajar con ficheros concretos frente a proyectos, eso diferencia el trabajo frente a CVS, que trabaja con base en cambios de fichero, pero mejora el trabajo con afectaciones de c&oacute;digo que concurren en operaciones similares en varios archivos.</li>
           <li>Los renombrados se trabajan bas&aacute;ndose en similitudes entre ficheros, aparte de nombres de ficheros, pero no se hacen marcas expl&iacute;citas de cambios de nombre con base en supuestos nombres &uacute;nicos de nodos de sistema de ficheros, lo que evita posibles, y posiblemente desastrosas, coincidencias de ficheros diferentes en un &uacute;nico nombre.</li>
           <li>Realmacenamiento peri&oacute;dico en paquetes (ficheros). Esto es relativamente eficiente para escritura de cambios y relativamente ineficiente para lectura si el reempaquetado (con base en diferencias) no ocurre cada cierto tiempo.</li>
         </ul>
         <p>Git. (2017, 25 de marzo).&nbsp;<em>Wikipedia, La enciclopedia libre</em>. Fecha de consulta: 18:59, abril 15, 2017 desde&nbsp;<a href="https://es.wikipedia.org/w/index.php?title=Git&amp;oldid=97838193">https://es.wikipedia.org/w/index.php?title=Git&amp;oldid=97838193</a></p>
       </div></td>
     <td width="553"><div align="center"><img src="Git-logo.svg.png" width="316" height="147" /></div>
     <p>&nbsp;</p>
     <p align="center"><img src="76905.gif" width="498" height="298" /></p>
     <p align="center">&nbsp;</p>
     <p align="center"><img src="basic-remote-workflow.png" width="499" height="397" /></p>
     <p align="center"><em>Tower versi&oacute;n control. (2016, 26 de abril) tomada de: <a href="https://www.git-tower.com/learn/git/ebook/en/command-line/remote-repositories/introduction">https://www.git-tower.com/learn/git/ebook/en/command-line/remote-repositories/introduction</a></em></p></td>
   </tr>
 </table>
 </center>
 <p>&nbsp;</p>
 <p>&nbsp;</p>
</body>
</html>
